{
    "articles": [
      {
        "id": 1,
        "slug": "teaching-building-when-lights-wont-stay-on",
        "title": "Teaching and building when the lights won't stay on",
        "author": "Sébastien Fenelon",
        "position": "Co-founder & CTO, E-strateji",
        "date": "2024-10-15",
        "category": "Founder Story",
        "excerpt": "How growing up with unreliable infrastructure shaped a philosophy of building for reality, not perfect conditions.",
        "featured_image": "https://res.cloudinary.com/dyeomcmin/image/upload/v1740777512/haiti-tech-education_ujkf8a.jpg",
        "content": "I learned to code in Haiti by copying snippets from PDFs onto borrowed machines, compiling between blackouts, and debugging offline because the Wi-Fi wouldn't hold. At 15 or 16 I finished my first real project—a small C++ web browser with a clean, personalized interface—passed around on flash drives because that was the most reliable 'network' we had. Those years taught me a rule I still live by: build for reality, not for perfect conditions.\n\nReality in Haiti is power cuts and patchy internet. Teachers can't promise a livestream at 2 p.m. Students study when electricity returns, not when the syllabus says so. Entrepreneurs chase a signal from one neighborhood to the next, screenshotting receipts before the connection drops. Clinics try to protect patient dignity while juggling devices that may or may not turn on. When the grid is unreliable and the news cycle unpredictable, technology should reduce stress, not add to it; it should respect privacy, stretch scarce bandwidth, and keep working when the bars on a phone disappear. Teknoloji a dwe mache menm lè entènèt la pa mache.\n\nThat's the context that shaped me as a self-taught software developer and shapes the companies I build now. My main work today is InthraOS, an operating system for private, on-device AI. The principle is simple: run intelligence locally first, and only reach for the cloud when a clear policy allows it. That design is not about chasing trends; it's about respect—respect for the family that pays for data by the megabyte, for the nurse who cannot send notes to a third party, for the student who studies after midnight when power finally returns. Local-first systems are not a luxury in Haiti; they are what make tools usable on a bad day and trustworthy on a good one.\n\nUnreliable infrastructure does more than slow tasks; it narrows horizons. If the lesson won't load, a student learns to expect disappointment. If a device bricks during a blackout, a clinic stops experimenting with new processes. If the internet is the only path to knowledge, the student without it is told—quietly—that learning is not for them. Empowerment begins with building around those limits: caching, download-first workflows, data that stays close to the person it belongs to, and interfaces that assume the network might vanish at any time.\n\nI carry that mindset into how we help people learn. E-Strateji is the platform my team is building to give Haitian and Caribbean learners practical, relevant courses that work offline. Modules are downloadable, pages can be bilingual, and topics reflect daily needs: civics and history of Haiti, small-business fundamentals, foundational tech, self-development, and creative skills like design and photography. The goal isn't to impress with features; it's to keep learning moving when the power flickers.\n\nMarketing and visual expert Jodarson Simin is my co-founder on E-Strateji, leading how lessons look, how creators present themselves, and how we meet learners where they are.\n\nI don't believe the answer to instability is to romanticize struggle or to pretend that software is enough. What we can do is design for the moments people actually face: download now, study later; draft a quiz without uploading a roster; prepare materials that survive a blackout; keep sensitive information in the room where it was created. Quiet reliability is a form of dignity.\n\nThere is another part to empowerment that matters as much as software: work. If Haiti's talent is always told to leave to be valued, we will keep exporting our future. So here is a concrete offer instead of a pitch. We are hiring Haitian talent and opening internships for engineers, designers, editors, curriculum builders, and community coordinators to help shape E-Strateji from the inside. Students who want to learn by doing, teachers with a course outline in Kreyòl or English, designers who know how to communicate clearly on a small screen—we want to collaborate, teach, and pay fairly. The more we anchor this work in Haitian hands, the more it will reflect Haitian realities.\n\nI became a founder because constraints forced me to be practical. The outages that slowed me as a teenager also trained me to build for failure first: save locally, resume gracefully, never assume a stable connection, and never treat a person's data as expendable. InthraOS exists because private, local AI is one durable way to honor those rules. E-Strateji exists because learning should not wait for perfect conditions. Neither is a silver bullet, but both are steps toward a future where students study with confidence, workers upskill without fear, and families feel safer sharing information.\n\nHaiti deserves tools that are steady when life is not. If we keep dignity at the center—privacy when handling data, patience when the power blinks, and pride in hiring our own—we can build systems that make people feel capable again. The lights will flicker; the work should not.",
        "keywords": ["Haiti", "education technology", "offline learning", "local-first AI", "digital infrastructure", "Caribbean tech", "self-taught developer", "InthraOS", "E-strateji"],
        "read_time": 8
      },
      {
        "id": 2,
        "slug": "designing-education-that-speaks-caribbean",
        "title": "Designing education that speaks the Caribbean's visual language",
        "author": "Jodarson Simin (Zaida)",
        "position": "Co-founder & Creative Director, E-strateji",
        "date": "2024-10-18",
        "category": "Founder Story",
        "excerpt": "How visual storytelling and cultural context are transforming digital education for Caribbean learners.",
        "featured_image": "https://res.cloudinary.com/dyeomcmin/image/upload/v1740777512/caribbean-design-education_mmxn8e.jpg",
        "content": "When I first started working in digital marketing and visual design across the Caribbean, I noticed something fundamental was missing from most educational platforms: they didn't look or feel like they were made for us. The colors were muted, the imagery generic, the cultural references foreign. Learning materials designed in Silicon Valley or Europe might have technical excellence, but they lacked soul—they didn't speak our visual language or understand our context.\n\nIn Haiti and across the Caribbean, visual communication isn't just decoration; it's a vital part of how we share knowledge. From the vibrant tap-tap buses that tell stories through art to the colorful markets where every arrangement communicates value, we understand information through rich, expressive visuals. Yet most e-learning platforms offer sterile interfaces that feel disconnected from our reality.\n\nAt E-strateji, we're changing that. Every course interface, every lesson layout, every color palette is designed with Caribbean visual literacy in mind. We use colors that reflect our landscapes—the deep blues of our coastlines, the vibrant greens of our mountains, the warm tones of our architecture. Our illustrations feature people who look like our learners, in settings that feel familiar rather than foreign.\n\nBut visual design is about more than aesthetics; it's about accessibility. Many of our learners access courses on mobile devices with limited data plans. We optimize every image, use efficient color schemes that work on various screen qualities, and ensure that visual elements enhance understanding rather than distract from it. A well-designed diagram can replace paragraphs of text, making complex concepts accessible even with limited bandwidth.\n\nCultural context is equally crucial. We're building bilingual interfaces that seamlessly switch between Kreyòl and English, recognizing that many Caribbean learners think and learn in multiple languages. Our course materials include local examples and case studies—when teaching business fundamentals, we might use examples from Haitian entrepreneurs or Jamaican small business owners rather than generic international corporations.\n\nOne of our most exciting projects is developing visual frameworks for traditionally text-heavy subjects. How do you make civics engaging? Through interactive timelines of Caribbean history, visual maps showing political structures, and character-driven stories that make governance relatable. How do you teach financial literacy? Through culturally relevant scenarios and visual budgeting tools that reflect local economic realities.\n\nThe most rewarding part has been collaborating with Caribbean creators and educators. We're working with Haitian artists to develop illustration styles that feel authentic, with Jamaican educators to design assessment methods that respect different learning styles, with Dominican teachers to create visual aids that work in classroom settings with limited technology.\n\nThis approach isn't just about making education 'pretty'—it's about making it effective. When learners see themselves reflected in their educational materials, when the interface feels intuitive rather than foreign, when cultural references make concepts stickier, learning becomes more engaging and retention improves.\n\nWe're proving that quality education doesn't have to mean importing foreign templates. The Caribbean has its own design traditions, its own visual languages, its own ways of knowing. By honoring these in our digital platforms, we're not just building another e-learning site—we're creating an educational experience that truly serves Caribbean learners.\n\nAs we expand across the region, we're committed to maintaining this cultural authenticity. Each new market brings opportunities to learn local visual preferences and incorporate regional design elements. The goal is an educational platform that feels equally at home in Port-au-Prince, Kingston, Santo Domingo, and beyond—unified in quality but diverse in its cultural expression.\n\nEducation should celebrate where we come from while preparing us for where we're going. Through thoughtful design, we're building bridges between our rich cultural heritage and the digital future—creating learning experiences that are not just effective, but truly ours.",
        "keywords": ["Caribbean design", "visual education", "cultural context", "bilingual learning", "educational design", "Caribbean creators", "mobile learning", "Kreyòl education", "visual storytelling"],
        "read_time": 7
      }
    ]
  }