{
    "newsroom": [
      {
        "id": 1,
        "slug": "caribbean-digital-education-gap-report-2024",
        "title": "New Report Reveals Caribbean Digital Education Gap: 65% of Students Lack Reliable Internet Access",
        "author": "E-strateji Research Team",
        "date": "2025-10-20",
        "category": "Research",
        "excerpt": "Groundbreaking study shows urgent need for offline-first educational solutions across the region.",
        "featured_image": "https://res.cloudinary.com/dyeomcmin/image/upload/v1760924578/bright-pop-landscape-design_n1drks.jpg",
        "content": "A comprehensive new study released today by E-strateji reveals that approximately 65% of students across the Caribbean face significant barriers to digital education due to unreliable internet connectivity and frequent power outages. The research, conducted across Haiti, Jamaica, Dominican Republic, and Trinidad and Tobago, highlights the urgent need for educational solutions that don't depend on constant connectivity.\n\nThe study found that students in rural areas experience internet downtime averaging 4-6 hours daily, with power outages affecting study schedules particularly during evening hours when many students complete assignments. 'The assumption that every student has 24/7 internet access is fundamentally flawed when designing education for the Caribbean context,' said Dr. Marie Baptiste, lead researcher on the project.\n\nKey findings include:\n- 72% of Haitian students rely on mobile data for education, with costs consuming up to 30% of family educational budgets\n- Only 15% of Jamaican students outside urban centers have consistent access to broadband internet\n- 58% of Dominican Republic students report studying primarily during periods when electricity is available\n- 81% of educators across the region express need for downloadable, offline-compatible learning materials\n\nThe report coincides with E-strateji's launch of new offline-first features, including downloadable course modules, cached assessments, and low-bandwidth video streaming optimized for Caribbean network conditions.",
        "keywords": ["digital divide", "Caribbean education", "offline learning", "educational technology", "research report", "internet access", "mobile learning"],
        "read_time": 4
      },
      {
        "id": 2,
        "slug": "haitian-history-curriculum-partnership",
        "title": "E-strateji Partners with Haitian Historians to Launch Comprehensive Digital History Curriculum",
        "author": "E-strateji Education Team",
        "date": "2025-10-17",
        "category": "Partnership",
        "excerpt": "Collaboration with leading Haitian scholars brings authentic Caribbean perspectives to digital education.",
        "featured_image": "https://res.cloudinary.com/dyeomcmin/image/upload/v1760838825/Screenshot_2025-10-18_at_9.51.00_PM_uxooid.png",
        "content": "E-strateji today announced a landmark partnership with the Association of Haitian Historians to develop the first comprehensive digital curriculum focused entirely on Haitian and Caribbean history from Caribbean perspectives. The initiative aims to address what educators have long identified as a critical gap in available educational materials.\n\n'For too long, Caribbean students have learned their own history through foreign lenses,' explained Professor Jean-Baptiste Bellegarde, president of the Association. 'This partnership allows us to share our history in our own words, with the nuance and depth it deserves.'\n\nThe curriculum will cover key periods including:\n- Pre-Columbian Caribbean civilizations and indigenous knowledge systems\n- The Haitian Revolution and its global impact\n- Post-independence development across the Caribbean\n- Contemporary Caribbean political and cultural movements\n- Diaspora contributions to global culture and innovation\n\nAll materials will be available in both Kreyòl and English, with interactive timelines, primary source documents, and multimedia content designed specifically for digital learning. The curriculum emphasizes critical thinking and multiple perspectives rather than rote memorization of dates and events.\n\n'This isn't just about adding Caribbean content to existing frameworks,' said Jodarson Simin, E-strateji's Creative Director. 'We're rebuilding the entire approach to ensure the visual design, narrative structure, and assessment methods reflect Caribbean ways of knowing and learning.'\n\nThe first modules are scheduled for release in early 2025, with the full curriculum rollout planned throughout the year. The partnership represents E-strateji's commitment to developing educational content by and for Caribbean communities.",
        "keywords": ["Haitian history", "Caribbean curriculum", "educational partnership", "Kreyòl education", "digital humanities", "history education", "cultural preservation"],
        "read_time": 5
      },
      {
        "id": 3,
        "slug": "caribbean-creator-fund-announcement",
        "title": "E-strateji Launches Caribbean Creator Fund to Support Local Educational Content Development",
        "author": "E-strateji Community Team",
        "date": "2025-10-14",
        "category": "Initiative",
        "excerpt": "$500,000 fund established to empower Caribbean educators and creators in developing digital learning materials.",
        "featured_image": "https://res.cloudinary.com/dyeomcmin/image/upload/v1760924545/businessman-restaurant-meal_wsz2kl.jpg",
        "content": "E-strateji has launched the Caribbean Creator Fund, a $500,000 initiative designed to support educators, artists, and subject matter experts across the region in developing high-quality digital learning content. The fund represents one of the largest investments in Caribbean-led educational content development to date.\n\n'There's incredible talent and expertise across the Caribbean, but too often creators lack the resources to develop their ideas into comprehensive educational materials,' said Sébastien Fenelon, E-strateji's CTO. 'This fund is about removing those barriers and ensuring Caribbean voices shape Caribbean education.'\n\nThe fund will provide:\n- Development grants of $5,000-$25,000 for course and content creation\n- Technical support and training in digital content development\n- Access to E-strateji's production resources and platform\n- Revenue sharing agreements for successful courses\n- Mentorship from established Caribbean educators and creators\n\nPriority areas for funding include STEM education with local applications, creative arts and design, entrepreneurship and small business development, Caribbean languages and literature, and civic education. Special consideration will be given to proposals that incorporate innovative approaches to offline learning and mobile optimization.\n\nApplications open November 1, 2024, with the first cohort of funded creators announced in January 2025. The initiative has already received support from regional educational organizations and diaspora communities.\n\n'This is exactly the kind of investment in local capacity that can transform education across our region,' said Dr. Alicia Fernandez, education policy expert at the University of the West Indies. 'When Caribbean creators develop Caribbean content, everyone benefits.'",
        "keywords": ["creator fund", "educational content", "Caribbean creators", "grant funding", "content development", "digital education", "regional investment"],
        "read_time": 4
      },
      {
        "id": 4,
        "slug": "jamaica-digital-literacy-pilot",
        "title": "E-strateji Partners with Jamaican Ministry of Education for Digital Literacy Pilot Program",
        "author": "E-strateji Partnerships Team",
        "date": "2025-10-12",
        "category": "Partnership",
        "excerpt": "Innovative program brings digital skills training to 50 schools across Jamaica using offline-first approach.",
        "featured_image": "https://res.cloudinary.com/dyeomcmin/image/upload/v1760924578/bright-pop-landscape-design_n1drks.jpg",
        "content": "E-strateji has launched a strategic partnership with the Jamaican Ministry of Education to pilot a comprehensive digital literacy program across 50 schools in rural and underserved communities. The initiative addresses the growing digital skills gap while accounting for Jamaica's specific infrastructure challenges.\n\nThe pilot program will provide:\n- Age-appropriate digital literacy curriculum for grades 6-9\n- Teacher training in digital education methodologies\n- Offline-compatible learning materials and assessments\n- Mobile-optimized content for smartphone access\n- Parent and community digital awareness workshops\n\n'This partnership represents a significant step forward in our mission to prepare Jamaican students for the digital economy,' said Hon. Fayval Williams, Minister of Education and Youth. 'E-strateji's understanding of Caribbean context makes them an ideal partner for this crucial initiative.'\n\nThe curriculum focuses on practical digital skills with immediate relevance to Jamaican students, including:\n- Digital citizenship and online safety\n- Basic coding concepts using visual programming tools\n- Digital media creation and storytelling\n- Research skills using local and regional resources\n- Introduction to Caribbean tech entrepreneurship\n\nA key innovation is the program's 'download and sync' approach, where materials are downloaded during school hours when internet is available and can be accessed offline later. This addresses the challenge of inconsistent home internet access that affects many Jamaican students.\n\nThe six-month pilot will serve as a model for potential expansion across Jamaica and other Caribbean nations. Success will be measured through student skill assessments, teacher feedback, and community engagement metrics.\n\n'We believe this partnership can demonstrate how digital education can be both high-quality and context-appropriate,' said Jodarson Simin. 'It's about building digital fluency that serves Jamaican students in their specific circumstances.'",
        "keywords": ["Jamaica education", "digital literacy", "ministry partnership", "pilot program", "digital skills", "Caribbean education", "offline learning"],
        "read_time": 5
      }
    ]
  }